sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_pcnt.c
/****************************************************************************
 * arch/risc-v/src/esp32p4/espressif/esp_pcnt.c
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed to the Apache Software Foundation (ASF) under one or more
 * contributor license agreements.  See the NOTICE file distributed with
 * this work for additional information regarding copyright ownership.  The
 * ASF licenses this file to you under the Apache License, Version 2.0 (the
 * "License"); you may not use this file except in compliance with the
 * License.  You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS, WITHOUT
 * WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.  See the
 * License for the specific language governing permissions and limitations
 * under the License.
 *
 ****************************************************************************/

/****************************************************************************
 * Included Files
 ****************************************************************************/

#include <nuttx/config.h>

#include <sys/param.h>
#include <sys/types.h>
#include <syslog.h>
#include <stdint.h>
#include <string.h>
#include <assert.h>
#include <debug.h>

#include <nuttx/arch.h>
#include <nuttx/irq.h>
#include <nuttx/timers/capture.h>
#include <nuttx/mutex.h>
#include <nuttx/nuttx.h>
#include <nuttx/kmalloc.h>
#include <arch/irq.h>
#include <nuttx/spinlock.h>
#include <nuttx/sensors/sensor.h>

#include "riscv_internal.h"
#include "esp_pcnt.h"
#include "esp_gpio.h"

#include "hal/pcnt_hal.h"
#include "hal/pcnt_ll.h"
#include "soc/gpio_sig_map.h"
#include "periph_ctrl.h"
#include "soc/soc_caps.h"
#include "hal/pcnt_periph.h"
#include "soc/pcnt_reg.h"
#include "soc/pcnt_struct.h"
#include "soc/gpio_pins.h"
#include "esp_clk.h"
#include "esp_irq.h"
#include "esp_attr.h"
#ifdef CONFIG_PM
#  include "include/esp_pm.h"
#endif

/****************************************************************************
 * Pre-processor Definitions
 ****************************************************************************/

#define PCNT_UNIT_COUNT                             PCNT_LL_GET(INST_NUM) * PCNT_LL_GET(UNITS_PER_INST)
#define GET_UNIT_ID_FROM_RET_CHAN(chan_id)          (int)(chan_id / PCNT_LL_GET(CHANS_PER_UNIT))
#define GET_CHAN_ID_FROM_RET_CHAN(unit_id, chan_id) (chan_id - (PCNT_LL_GET(CHANS_PER_UNIT) * unit_id))
#define CREATE_RET_CHAN_ID(unit_id, chan_id)        ((PCNT_LL_GET(CHANS_PER_UNIT) * unit_id) + chan_id)

#if !SOC_RCC_IS_INDEPENDENT
#  define PCNT_RCC_ATOMIC() PERIPH_RCC_ATOMIC()
#else
#  define PCNT_RCC_ATOMIC()
#endif

/****************************************************************************
 * Private Types
 ****************************************************************************/

/* PCNT unit states */

enum esp_pcntstate_e
{
  PCNT_UNIT_INIT,
  PCNT_UNIT_ENABLE,
};

struct esp_pcnt_glitch_filter_config_s
{
    uint32_t max_glitch_ns;     /* Pulse width threshold, in ns */
};

/* PCNT Unit Watch Point Private Data */

struct esp_pcnt_watch_point_priv_s
{
    pcnt_ll_watch_event_id_t event_id; /* Event type */
    int watch_point_value;             /* Value to be watched */
};

/* PCNT Unit Private Data */

struct esp_pcnt_priv_s
{
  const struct cap_ops_s *ops;
  int unit_id;                                                          /* PCNT unit id */
  int group_id;                                                         /* PCNT group id */
  volatile enum esp_pcntstate_e state;                                  /* PCNT unit work state (see enum esp_pcntstate_e) */
  struct esp_pcnt_unit_config_s config;                                 /* Configuration struct */
  bool unit_used;                                                       /* PCNT unit usage flag */
  bool intr;                                                            /* PCNT unit interrupt enable flag */
  spinlock_t lock;                                                      /* Device specific lock. */
  int (*cb)(int, void *, void *);                                       /* User defined callback */
  uint32_t accum_value;                                                 /* Accumulator value of overflowed PCNT unit */
  bool channels[PCNT_LL_GET(CHANS_PER_UNIT)];                           /* Channel information of PCNT unit */
  struct esp_pcnt_watch_point_priv_s watchers[PCNT_LL_WATCH_EVENT_MAX]; /* array of PCNT watchers */
#ifdef CONFIG_PM
  esp_pm_lock_handle_t pm_lock;                                         /* Power management lock */
#endif
};

/****************************************************************************
 * Private Function Prototypes
 ****************************************************************************/

static int esp_pcnt_open(struct cap_lowerhalf_s *dev);
static int esp_pcnt_close(struct cap_lowerhalf_s *dev);
static int IRAM_ATTR esp_pcnt_isr_default(int irq, void *context, void *arg);
static int esp_pcnt_isr_register(int (*fn)(int, void *, void *), void *arg);
static int esp_pcnt_ioctl(struct cap_lowerhalf_s *dev, int cmd,
                          unsigned long arg);
static int esp_pcnt_unit_enable(struct cap_lowerhalf_s *dev);
static int esp_pcnt_unit_disable(struct cap_lowerhalf_s *dev);
static int esp_pcnt_unit_start(struct cap_lowerhalf_s *dev);
static int esp_pcnt_unit_stop(struct cap_lowerhalf_s *dev);
static int esp_pcnt_unit_get_count(struct cap_lowerhalf_s *dev, int *ret);
static int esp_pcnt_unit_clear_count(struct cap_lowerhalf_s *dev);
static int esp_pcnt_unit_set_glitch_filter(struct cap_lowerhalf_s *dev,
    const struct esp_pcnt_glitch_filter_config_s *config);
static int esp_pcnt_unit_register_event_callback(struct cap_lowerhalf_s *dev,
                                           int (*fn)(int, void *, void *));

/****************************************************************************
 * Private Data
 ****************************************************************************/

/* Standard file operations */

static const struct cap_ops_s g_esp_pcnt_fops =
{
  .start       = esp_pcnt_open,
  .stop        = esp_pcnt_close,
  .getduty     = NULL,
  .getfreq     = NULL,
  .ioctl       = esp_pcnt_ioctl,
};

static struct esp_pcnt_priv_s pcnt_units[PCNT_UNIT_COUNT] =
{
    0
};

