sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_pcnt.c
static pcnt_hal_context_t ctx;                     /* Struct of the common layer */
static mutex_t g_pcnt_mutex = NXMUTEX_INITIALIZER; /* Mutual exclusion m:utex */
static bool g_pcnt_intr = false;                   /* ISR register flag for peripheral */
static spinlock_t g_pcnt_lock = SP_UNLOCKED;       /* PCNT unit lock */
static int g_pcnt_refs[PCNT_LL_GET(INST_NUM)] =    /* Reference count */
  {
    0
  };

/****************************************************************************
 * Private Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp_pcnt_close
 *
 * Description:
 *   Stop PCNT unit from counting.
 *
 * Input Parameters:
 *   filep  - The pointer of file, represents each user using the sensor
 *
 * Returned Value:
 *   Returns OK on success; a negated errno value on failure
 *
 ****************************************************************************/

static int esp_pcnt_close(struct cap_lowerhalf_s *dev)
{
  struct esp_pcnt_priv_s *priv = (struct esp_pcnt_priv_s *)dev;
  int ret = OK;

  ret = esp_pcnt_unit_stop(dev);
  if (ret != OK)
    {
      cperr("Failed to stop pcnt-%d", priv->unit_id);
      return ret;
    }

  if (priv->state != PCNT_UNIT_INIT)
    {
      ret = esp_pcnt_unit_disable(dev);
      if (ret != OK)
        {
          cperr("Failed to disable pcnt-%d", priv->unit_id);
        }
    }

  return ret;
}

/****************************************************************************
 * Name: esp_pcnt_open
 *
 * Description:
 *   Start PCNT unit for counting.
 *
 * Input Parameters:
 *   filep  - The pointer of file, represents each user using the sensor
 *
 * Returned Value:
 *   Returns OK on success; a negated errno value on failure
 *
 ****************************************************************************/

static int esp_pcnt_open(struct cap_lowerhalf_s *dev)
{
  struct esp_pcnt_priv_s *priv = (struct esp_pcnt_priv_s *)dev;
  int ret = OK;

  if (priv->state == PCNT_UNIT_INIT)
    {
      ret = esp_pcnt_unit_enable(dev);
      if (ret != OK)
        {
          cperr("Failed to enable pcnt-%d", priv->unit_id);
          return ret;
        }
    }

  ret = esp_pcnt_unit_start(dev);
  if (ret != OK)
    {
       cperr("Failed to start pcnt-%d", priv->unit_id);
    }

  return ret;
}

/****************************************************************************
 * Name: esp_pcnt_ioctl
 *
 * Description:
 *   Lower-half logic may support platform-specific ioctl commands
 *
 * Input Parameters:
 *   filep - The pointer of file, represents each user using the sensor
 *   cmd   - The ioctl command
 *   arg   - The argument accompanying the ioctl command
 *
 * Returned Value:
 *   Zero on success; a negated errno value on failure
 *
 ****************************************************************************/

static int esp_pcnt_ioctl(struct cap_lowerhalf_s *dev, int cmd,
                          unsigned long arg)
{
  struct esp_pcnt_priv_s *priv = (struct esp_pcnt_priv_s *)dev;

  struct esp_pcnt_glitch_filter_config_s glitch_config;
  int ret = 0;
  xcpt_t handler;

  /* Decode and dispatch the driver-specific IOCTL command */

  switch (cmd)
    {
      case CAPIOC_PULSES:

        /* Get PCNT unit count value */

        ret = esp_pcnt_unit_get_count(dev, (int *)arg);
        if (ret != OK)
          {
            cperr("Could not get count from pcnt-%d!\n", priv->unit_id);
          }

        break;

      case CAPIOC_CLR_CNT:

        /* Clear PCNT unit count value */

        ret = esp_pcnt_unit_clear_count(dev);
        if (ret != OK)
          {
            cperr("Could not clear pcnt-%d!\n", priv->unit_id);
          }

        break;

      case CAPIOC_FILTER:

        /* Configure glitch filter */

        if (arg != 0)
          {
            glitch_config.max_glitch_ns = arg;
            ret = esp_pcnt_unit_set_glitch_filter(dev, &glitch_config);
          }
        else
          {
            ret = esp_pcnt_unit_set_glitch_filter(dev, NULL);
          }

        if (ret != OK)
          {
            cperr("Could not to set glitch filter to pcnt-%d!\n",
                  priv->unit_id);
          }

        break;

      case CAPIOC_HANDLER:

        /* Set event callback */

        handler = (xcpt_t)arg;
        ret = esp_pcnt_unit_register_event_callback(dev, handler);
        if (ret != OK)
          {
            cperr("Could not register callback-%lx to pcnt-%d!\n",
                  (uint32_t)handler, priv->unit_id);
          }

        break;

      case CAPIOC_ADD_WP:

        /* Add watch point */

        ret = esp_pcnt_unit_add_watch_point(dev, (int)arg);
        if (ret != OK)
          {
            cperr("Could not to add watch point-%d to pcnt-%d!\n",
                  (int)arg, priv->unit_id);
          }

        break;

      default:
        cperr("Unrecognized IOCTL command: %d\n", cmd);
        ret = -ENOTTY;
        break;
    }

  return ret;
}

/****************************************************************************
 * Name: esp_pcnt_isr_default
 *
 * Description:
 *   Handler for the PCNT controller interrupt.
 *
 * Input Parameters:
 *   irq     - Number of the IRQ that generated the interrupt
 *   context - Interrupt register state save info
 *   arg     - PCNT controller private data
 *
 * Returned Value:
 *   Standard interrupt return value.
 *
 ****************************************************************************/

static int IRAM_ATTR esp_pcnt_isr_default(int irq, void *context, void *arg)
{
  struct esp_pcnt_priv_s *unit;
  int unit_id = 0;
  uint32_t event_status = 0;
  uint32_t intr_status = pcnt_ll_get_intr_status(ctx.dev);
  struct esp_pcnt_watch_event_data_s data;
  irqstate_t flags;

  for (unit_id = 0; unit_id < PCNT_LL_GET(UNITS_PER_INST); unit_id++)
    {
      if (intr_status & PCNT_LL_UNIT_WATCH_EVENT(unit_id))
        break;
    }

  if (unit_id < PCNT_LL_GET(UNITS_PER_INST))
    {
      unit = &pcnt_units[unit_id];
      pcnt_ll_clear_intr_status(ctx.dev, PCNT_LL_UNIT_WATCH_EVENT(unit_id));
      event_status = pcnt_ll_get_event_status(ctx.dev, unit_id);
      flags = spin_lock_irqsave(&unit->lock);
      while (event_status)
        {
          int event_id = __builtin_ffs(event_status) - 1;
          event_status &= (event_status - 1);

