sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_pcnt.c
          if (unit->config.accum_count)
            {
              if (event_id == PCNT_LL_WATCH_EVENT_LOW_LIMIT)
                {
                  unit->accum_value += unit->config.low_limit;
                }
              else if (event_id == PCNT_LL_WATCH_EVENT_HIGH_LIMIT)
                {
                  unit->accum_value += unit->config.high_limit;
                }
            }

          if (unit->cb)
            {
              data.unit_id = unit_id;
              data.watch_point_value =
                unit->watchers[event_id].watch_point_value;
              data.zero_cross_mode =
                pcnt_ll_get_zero_cross_mode(ctx.dev, unit_id);
              unit->cb(irq, context, &data);
            }
        }

      spin_unlock_irqrestore(&unit->lock, flags);
    }

  return 0;
}

/****************************************************************************
 * Name: esp_pcnt_isr_register
 *
 * Description:
 *   This function registers an interrupt service routine (ISR) for the PCNT
 *   peripheral. It allocates a CPU interrupt, attaches the ISR to the
 *   interrupt, and returns the status of the operation.
 *
 * Input Parameters:
 *   fn               - Pointer to the ISR function.
 *   arg              - Pointer to the argument to be passed to the ISR.
 *
 * Returned Value:
 *   Returns OK on successful registration of the ISR; a negated errno value
 *   is returned on any failure.
 *
 ****************************************************************************/

static int esp_pcnt_isr_register(int (*fn)(int, void *, void *), void *arg)
{
  int cpuint;
  int ret;
  int cpu = this_cpu();

  DEBUGASSERT(fn);

  cpuint = esp_setup_irq(soc_pcnt_signals[0].irq_id,
                         ESP_IRQ_PRIORITY_DEFAULT,
                         ESP_IRQ_TRIGGER_LEVEL,
                         fn,
                         arg);
  if (cpuint < 0)
    {
      cperr("Failed to allocate a CPU interrupt.\n");
      return ERROR;
    }

  up_enable_irq(ESP_SOURCE2IRQ(soc_pcnt_signals[0].irq_id));
  return OK;
}

/****************************************************************************
 * Name: esp_pcnt_unit_enable
 *
 * Description:
 *   Enable PCNT unit.
 *
 * Input Parameters:
 *   dev - Pointer to the pcnt driver struct
 *
 * Returned Value:
 *   OK on success; ERROR on failure
 *
 ****************************************************************************/

static int esp_pcnt_unit_enable(struct cap_lowerhalf_s *dev)
{
  struct esp_pcnt_priv_s *priv = (struct esp_pcnt_priv_s *)dev;

  if (!priv->unit_used)
    {
      cperr("Invalid unit ID!\n");
      return ERROR;
    }

  if (priv->state != PCNT_UNIT_INIT)
    {
      cperr("Unit is already enabled!\n");
      return ERROR;
    }

  if (priv->intr)
    {
      pcnt_ll_enable_intr(ctx.dev, PCNT_LL_UNIT_WATCH_EVENT(priv->unit_id),
                          true);
    }

#ifdef CONFIG_PM
  esp_pm_lock_acquire(priv->pm_lock);
#endif

  priv->state = PCNT_UNIT_ENABLE;
  return OK;
}

/****************************************************************************
 * Name: esp_pcnt_unit_disable
 *
 * Description:
 *   Disable PCNT unit.
 *
 * Input Parameters:
 *   dev - Pointer to the pcnt driver struct
 *
 * Returned Value:
 *   OK on success; ERROR on failure
 *
 ****************************************************************************/

static int esp_pcnt_unit_disable(struct cap_lowerhalf_s *dev)
{
  struct esp_pcnt_priv_s *priv = (struct esp_pcnt_priv_s *)dev;

  if (!priv->unit_used)
    {
      cperr("Invalid unit ID!\n");
      return ERROR;
    }

  if (priv->state != PCNT_UNIT_ENABLE)
    {
      cperr("Unit is already disabled!\n");
      return ERROR;
    }

  if (priv->intr)
    {
      pcnt_ll_enable_intr(ctx.dev, PCNT_LL_UNIT_WATCH_EVENT(priv->unit_id),
                          false);
    }

#ifdef CONFIG_PM
  esp_pm_lock_release(priv->pm_lock);
#endif

  priv->state = PCNT_UNIT_INIT;
  return OK;
}

/****************************************************************************
 * Name: esp_pcnt_unit_start
 *
 * Description:
 *   Start PCNT unit for counting.
 *
 * Input Parameters:
 *   dev - Pointer to the pcnt driver struct
 *
 * Returned Value:
 *   OK on success; ERROR on failure
 *
 ****************************************************************************/

static int esp_pcnt_unit_start(struct cap_lowerhalf_s *dev)
{
  struct esp_pcnt_priv_s *priv = (struct esp_pcnt_priv_s *)dev;
  irqstate_t flags;

  if (priv->state != PCNT_UNIT_ENABLE)
    {
      cperr("Unit not enabled yet!\n");
      return ERROR;
    }

  flags = spin_lock_irqsave(&priv->lock);
  pcnt_ll_start_count(ctx.dev, priv->unit_id);
  spin_unlock_irqrestore(&priv->lock, flags);

  return OK;
}

/****************************************************************************
 * Name: esp_pcnt_unit_stop
 *
 * Description:
 *   Stop PCNT unit from counting.
 *
 * Input Parameters:
 *   dev - Pointer to the pcnt driver struct
 *
 * Returned Value:
 *   OK on success; ERROR on failure
 *
 ****************************************************************************/

static int esp_pcnt_unit_stop(struct cap_lowerhalf_s *dev)
{
  struct esp_pcnt_priv_s *priv = (struct esp_pcnt_priv_s *)dev;
  irqstate_t flags;

  if (priv->state != PCNT_UNIT_ENABLE)
    {
      cperr("Unit not enabled yet!\n");
      return ERROR;
    }

  flags = spin_lock_irqsave(&priv->lock);
  pcnt_ll_stop_count(ctx.dev, priv->unit_id);
  spin_unlock_irqrestore(&priv->lock, flags);
  return OK;
}

/****************************************************************************
 * Name: esp_pcnt_unit_get_count
 *
 * Description:
 *   Get count value given of PCNT unit.
 *
 * Input Parameters:
 *   dev - Pointer to the pcnt driver struct
 *   ret - Returned count value
 *
 * Returned Value:
 *   OK on success; ERROR on failure
 *
 ****************************************************************************/

static int esp_pcnt_unit_get_count(struct cap_lowerhalf_s *dev, int *ret)
{
  struct esp_pcnt_priv_s *priv = (struct esp_pcnt_priv_s *)dev;
  irqstate_t flags;
  int32_t tmp_count;
  uint32_t event_status;
  uint32_t intr_status;

  if (!priv->unit_used)
    {
      cperr("Invalid unit ID!\n");
      return ERROR;
    }

  flags = spin_lock_irqsave(&priv->lock);
  tmp_count = pcnt_ll_get_count(ctx.dev, priv->unit_id);

  if (priv->config.accum_count)
    {
      intr_status = pcnt_ll_get_intr_status(ctx.dev);
      if (intr_status & PCNT_LL_UNIT_WATCH_EVENT(priv->unit_id))
        {
          event_status = pcnt_ll_get_event_status(ctx.dev, priv->unit_id);
          if ((event_status & (1 << PCNT_LL_WATCH_EVENT_LOW_LIMIT)) && \
              (tmp_count >= (priv->config.low_limit / 2)))
            {
              tmp_count += priv->config.low_limit;
            }
          else if ((event_status & \
                    (1 << PCNT_LL_WATCH_EVENT_HIGH_LIMIT)) && \
                   (tmp_count <= (priv->config.high_limit / 2)))
            {
              tmp_count += priv->config.high_limit;
            }
        }
    }

  *ret = tmp_count + priv->accum_value;
  spin_unlock_irqrestore(&priv->lock, flags);

  return OK;
}

/****************************************************************************
 * Name: esp_pcnt_unit_clear_count
 *
 * Description:
 *   Clear count value given of PCNT unit.
 *
 * Input Parameters:
 *   dev - Pointer to the pcnt driver struct
 *
 * Returned Value:
 *   OK on success; ERROR on failure
 *
 ****************************************************************************/

