sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_pcnt.c
static int esp_pcnt_unit_clear_count(struct cap_lowerhalf_s *dev)
{
  struct esp_pcnt_priv_s *priv = (struct esp_pcnt_priv_s *)dev;
  irqstate_t flags;

  if (!priv->unit_used)
    {
      cperr("Invalid unit ID!\n");
      return ERROR;
    }

  flags = spin_lock_irqsave(&priv->lock);
  pcnt_ll_clear_count(ctx.dev, priv->unit_id);
  priv->accum_value = 0;
  spin_unlock_irqrestore(&priv->lock, flags);

  return OK;
}

/****************************************************************************
 * Name: esp_pcnt_unit_set_glitch_filter
 *
 * Description:
 *   Configure glitch filter of given unit.
 *
 * Input Parameters:
 *   dev    - Pointer to the pcnt driver struct
 *   config - Glitch filter configuration
 *
 * Returned Value:
 *   OK on success; ERROR on failure
 *
 ****************************************************************************/

static int esp_pcnt_unit_set_glitch_filter(struct cap_lowerhalf_s *dev,
    const struct esp_pcnt_glitch_filter_config_s *config)
{
  struct esp_pcnt_priv_s *priv = (struct esp_pcnt_priv_s *)dev;
  uint32_t glitch_filter_thres = 0;
  irqstate_t flags;

  if (config != NULL)
    {
      glitch_filter_thres = ((esp_clk_apb_freq() / 1000000) *
                             (config->max_glitch_ns / 1000));
      if (glitch_filter_thres > PCNT_LL_MAX_GLITCH_WIDTH)
        {
          cperr("Glitch width %" PRId32 " out of range!\n",
                config->max_glitch_ns);
          return ERROR;
        }
    }

  flags = spin_lock_irqsave(&priv->lock);
  if (config != NULL)
    {
      pcnt_ll_set_glitch_filter_thres(ctx.dev, priv->unit_id,
                                      glitch_filter_thres);
      pcnt_ll_enable_glitch_filter(ctx.dev, priv->unit_id, true);
    }
  else
    {
      pcnt_ll_enable_glitch_filter(ctx.dev, priv->unit_id, false);
    }

  spin_unlock_irqrestore(&priv->lock, flags);
  return OK;
}

/****************************************************************************
 * Name: esp_pcnt_unit_register_event_callback
 *
 * Description:
 *   Set event callbacks for PCNT unit
 *
 * Input Parameters:
 *   dev - Pointer to the pcnt driver struct
 *   fn  - Pointer to the ISR function.
 *
 * Returned Value:
 *   Returns OK on successful registration of the ISR; a negated errno value
 *   is returned on any failure.
 *
 ****************************************************************************/

static int esp_pcnt_unit_register_event_callback(struct cap_lowerhalf_s *dev,
                                           int (*fn)(int, void *, void *))
{
  struct esp_pcnt_priv_s *priv = (struct esp_pcnt_priv_s *)dev;
  int ret = OK;
  int intr_flag = (fn != NULL) ? 1 : 0;
  irqstate_t flags;

  priv->intr = intr_flag;
  flags = spin_lock_irqsave(&priv->lock);
  pcnt_ll_enable_intr(ctx.dev, PCNT_LL_UNIT_WATCH_EVENT(priv->unit_id),
                      intr_flag);
  spin_unlock_irqrestore(&priv->lock, flags);
  priv->cb = fn;

  return ret;
}

/****************************************************************************
 * Public Functions
 ****************************************************************************/

/****************************************************************************
 * Name: esp_pcnt_new_unit
 *
 * Description:
 *   Request PCNT unit and config it with given parameters.
 *
 * Input Parameters:
 *   config - PCNT unit configuration
 *
 * Returned Value:
 *   PCNT unit number (>=0) if success or -1 if fail.
 *
 ****************************************************************************/

struct cap_lowerhalf_s *esp_pcnt_new_unit(
  struct esp_pcnt_unit_config_s *config)
{
  int unit_id;
  int group_id;
  int cpuint;
  int cpu = this_cpu();
  int ret;
  int i;
  irqstate_t flags;
#ifdef CONFIG_PM
  esp_pm_lock_type_t pm_lock_type = ESP_PM_NO_LIGHT_SLEEP;
#endif

  if (config == NULL)
    {
      cperr("Configuration struct is NULL!\n");
      return NULL;
    }

  if (config->low_limit >= 0 && config->low_limit < PCNT_LL_MIN_LIM)
    {
      cperr("Configuration low limit is out of range!\n");
      return NULL;
    }

  if (config->high_limit < 0 && config->high_limit >= PCNT_LL_MAX_LIM)
    {
      cperr("Configuration high limit is out of range!\n");
      return NULL;
    }

  flags = spin_lock_irqsave(&g_pcnt_lock);

  /* Find a free PCNT unit */

  for (unit_id = 0; unit_id < PCNT_UNIT_COUNT; unit_id++)
    {
      if (!pcnt_units[unit_id].unit_used)
        {
          pcnt_units[unit_id].unit_used = true;
          group_id = unit_id / PCNT_LL_GET(UNITS_PER_INST);
          pcnt_units[unit_id].group_id = group_id;
          break;
        }
    }

  if (g_pcnt_refs[group_id]++ == 0)
    {
      PCNT_RCC_ATOMIC()
        {
          pcnt_ll_enable_bus_clock(group_id, true);
          pcnt_ll_reset_register(group_id);
        }

      pcnt_hal_init(&ctx, group_id);
    }

  if (unit_id == PCNT_UNIT_COUNT)
    {
      cperr("No available PCNT unit for allocation\n");

      spin_unlock_irqrestore(&g_pcnt_lock, flags);
      return NULL;
    }

  spin_unlock_irqrestore(&g_pcnt_lock, flags);
  cpinfo("Allocated pcnt unit: %" PRId16 "\n", unit_id);

#ifdef CONFIG_PM
#  if PCNT_LL_CLOCK_SUPPORT_APB
  if (PCNT_CLK_SRC_DEFAULT == PCNT_CLK_SRC_APB)
    {
      pm_lock_type = ESP_PM_APB_FREQ_MAX;
    }

#  endif
  ret = esp_pm_lock_create(pm_lock_type,
                           0,
                           soc_pcnt_signals[unit_id].module_name,
                           &pcnt_units[unit_id].pm_lock);
  if (ret != OK)
    {
      cperr("Failed to create PCNT PM lock\n");
      return NULL;
    }
#endif

  if (!g_pcnt_intr)
    {
      nxmutex_lock(&g_pcnt_mutex);
      ret = esp_pcnt_isr_register(esp_pcnt_isr_default, NULL);
      if (ret < 0)
        {
          pcnt_units[unit_id].unit_used = false;
          nxmutex_unlock(&g_pcnt_mutex);
          return NULL;
        }

      g_pcnt_intr = true;
      nxmutex_unlock(&g_pcnt_mutex);
    }

  pcnt_ll_disable_all_events(ctx.dev, unit_id);

  pcnt_ll_enable_high_limit_event(ctx.dev, unit_id, config->accum_count);
  pcnt_ll_enable_low_limit_event(ctx.dev, unit_id, config->accum_count);

  pcnt_ll_enable_glitch_filter(ctx.dev, unit_id, false);
  pcnt_ll_set_high_limit_value(ctx.dev, unit_id, config->high_limit);
  pcnt_ll_set_low_limit_value(ctx.dev, unit_id, config->low_limit);

  pcnt_units[unit_id].config.high_limit = config->high_limit;
  pcnt_units[unit_id].config.low_limit = config->low_limit;
  pcnt_units[unit_id].config.accum_count = config->accum_count;
  pcnt_units[unit_id].intr = config->accum_count;
  pcnt_units[unit_id].accum_value = 0;
  pcnt_units[unit_id].unit_id = unit_id;
  pcnt_units[unit_id].ops = &g_esp_pcnt_fops;

  flags = spin_lock_irqsave(&pcnt_units[unit_id].lock);

  pcnt_ll_stop_count(ctx.dev, unit_id);
  pcnt_ll_clear_count(ctx.dev, unit_id);

