sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_pcnt.c
  pcnt_ll_enable_intr(ctx.dev, PCNT_LL_UNIT_WATCH_EVENT(unit_id),
                      config->accum_count);
  pcnt_ll_clear_intr_status(ctx.dev, PCNT_LL_UNIT_WATCH_EVENT(unit_id));
  spin_unlock_irqrestore(&pcnt_units[unit_id].lock, flags);

  pcnt_units[unit_id].state = PCNT_UNIT_INIT;
  for (i = 0; i < PCNT_LL_WATCH_EVENT_MAX; i++)
    {
      pcnt_units[unit_id].watchers[i].event_id = PCNT_LL_WATCH_EVENT_INVALID;
    }

  cpinfo("Allocated pcnt unit: %" PRId16 " count range:[%d %d]\n", unit_id,
         pcnt_units[unit_id].config.low_limit,
         pcnt_units[unit_id].config.high_limit);

  return (struct cap_lowerhalf_s *)&pcnt_units[unit_id];
}

/****************************************************************************
 * Name: esp_pcnt_del_unit
 *
 * Description:
 *   Delete PCNT unit.
 *
 * Input Parameters:
 *   dev - Pointer to the pcnt driver struct
 *
 * Returned Value:
 *   OK on success; ERROR on failure
 *
 ****************************************************************************/

int esp_pcnt_del_unit(struct cap_lowerhalf_s *dev)
{
  struct esp_pcnt_priv_s *priv = (struct esp_pcnt_priv_s *)dev;
  int i;
  irqstate_t flags;

  if (priv->state != PCNT_UNIT_INIT)
    {
      cperr("Unit is running!\n");
      return ERROR;
    }

  for (i = 0; i < PCNT_LL_GET(CHANS_PER_UNIT); i++)
    {
      if (!priv->channels[i])
        {
          cperr("Channel %" PRId8
                  " still in working!\n", i);
          return ERROR;
        }
    }

  cpinfo("Delete pcnt unit: %" PRId8 "\n", priv->unit_id);

  if (priv->intr)
    {
      pcnt_ll_enable_intr(ctx.dev, PCNT_LL_UNIT_WATCH_EVENT(priv->unit_id),
                          false);
      priv->intr = false;
    }

  flags = spin_lock_irqsave(&priv->lock);
  priv->unit_used = false;
  g_pcnt_refs[priv->group_id]--;
  if (g_pcnt_refs[priv->group_id] == 0)
    {
      PCNT_RCC_ATOMIC()
        {
          pcnt_ll_enable_bus_clock(priv->group_id, false);
        }

      esp_teardown_irq(soc_pcnt_signals[0].irq_id, -ENOMEM);
    }

#ifdef CONFIG_PM
  esp_pm_lock_delete(priv->pm_lock);
  priv->pm_lock = NULL;
#endif

  spin_unlock_irqrestore(&priv->lock, flags);

  return OK;
}

/****************************************************************************
 * Name: esp_pcnt_unit_add_watch_point
 *
 * Description:
 *   Add watch point to given PCNT unit.
 *
 * Input Parameters:
 *   dev - Pointer to the pcnt driver struct
 *   ret - Value to watch
 *
 * Returned Value:
 *   OK on success; ERROR on failure
 *
 ****************************************************************************/

int esp_pcnt_unit_add_watch_point(struct cap_lowerhalf_s *dev,
                                  int watch_point)
{
  struct esp_pcnt_priv_s *unit = (struct esp_pcnt_priv_s *)dev;
  int ret = OK;
  struct esp_pcnt_watch_point_priv_s *wp;
  irqstate_t flags;

  if (watch_point > unit->config.high_limit ||
      watch_point < unit->config.low_limit)
    {
      cperr("Watch point is out of limit!\n");
      return ERROR;
    }

  flags = spin_lock_irqsave(&unit->lock);

  /* zero cross watch point */

  if (watch_point == 0)
    {
      if (unit->watchers[PCNT_LL_WATCH_EVENT_ZERO_CROSS].event_id !=
          PCNT_LL_WATCH_EVENT_INVALID)
        {
          cperr("Zero cross event watcher has been installed already!\n");
          ret = ERROR;
        }
      else
        {
          unit->watchers[PCNT_LL_WATCH_EVENT_ZERO_CROSS].event_id =
            PCNT_LL_WATCH_EVENT_ZERO_CROSS;
          unit->watchers[PCNT_LL_WATCH_EVENT_ZERO_CROSS].watch_point_value =
            0;
          pcnt_ll_enable_zero_cross_event(ctx.dev,
                                          unit->unit_id,
                                          true);
        }
    }

  /* high limit watch point */

  else if (watch_point == unit->config.high_limit)
    {
      if (unit->watchers[PCNT_LL_WATCH_EVENT_HIGH_LIMIT].event_id !=
          PCNT_LL_WATCH_EVENT_INVALID)
        {
          cperr("High limit event watcher has been installed already!\n");
          ret = ERROR;
        }
      else
        {
          unit->watchers[PCNT_LL_WATCH_EVENT_HIGH_LIMIT].event_id =
            PCNT_LL_WATCH_EVENT_HIGH_LIMIT;
          unit->watchers[PCNT_LL_WATCH_EVENT_HIGH_LIMIT].watch_point_value =
            unit->config.high_limit;
          pcnt_ll_enable_high_limit_event(ctx.dev,
                                          unit->unit_id,
                                          true);
        }
    }

  /* low limit watch point */

  else if (watch_point == unit->config.low_limit)
    {
      if (unit->watchers[PCNT_LL_WATCH_EVENT_LOW_LIMIT].event_id !=
          PCNT_LL_WATCH_EVENT_INVALID)
        {
          cperr("Low limit event watcher has been installed already!\n");
          ret = ERROR;
        }
      else
        {
          unit->watchers[PCNT_LL_WATCH_EVENT_LOW_LIMIT].event_id =
            PCNT_LL_WATCH_EVENT_LOW_LIMIT;
          unit->watchers[PCNT_LL_WATCH_EVENT_LOW_LIMIT].watch_point_value =
            unit->config.low_limit;
          pcnt_ll_enable_low_limit_event(ctx.dev,
                                         unit->unit_id,
                                         true);
        }
    }

  /* other threshold watch point */

  else
    {
      int thres_num = PCNT_LL_GET(THRES_POINT_PER_UNIT) - 1;
      switch (thres_num)
        {
          case 1:
            wp = &unit->watchers[PCNT_LL_WATCH_EVENT_THRES1];
            if (wp->event_id == PCNT_LL_WATCH_EVENT_INVALID)
              {
                wp->event_id = PCNT_LL_WATCH_EVENT_THRES1;
                wp->watch_point_value = watch_point;
                pcnt_ll_set_thres_value(ctx.dev,
                                        unit->unit_id,
                                        1,
                                        watch_point);
                pcnt_ll_enable_thres_event(ctx.dev,
                                           unit->unit_id,
                                           1,
                                           true);
                break;
              }
          else if (wp->watch_point_value == watch_point)
            {
              cperr("Watcher has been installed already!\n");
              ret = ERROR;
              break;
            }

          case 0:
            wp = &unit->watchers[PCNT_LL_WATCH_EVENT_THRES0];
            if (wp->event_id == PCNT_LL_WATCH_EVENT_INVALID)
              {
                wp->event_id = PCNT_LL_WATCH_EVENT_THRES0;
                wp->watch_point_value = watch_point;
                pcnt_ll_set_thres_value(ctx.dev,
                                        unit->unit_id,
                                        0,
                                        watch_point);
                pcnt_ll_enable_thres_event(ctx.dev,
                                           unit->unit_id,
                                           0,
                                           true);
                break;
              }
            else if (wp->watch_point_value == watch_point)
              {
                cperr("Watcher has been installed already!\n");
                ret = ERROR;
                break;
              }

      default:
          cperr("No free threshold watch point available!\n");
          ret = ERROR;
          break;
      }
    }

  spin_unlock_irqrestore(&unit->lock, flags);

  if (ret != ERROR)
    {
      cpinfo("Watchpoint %d for pcnt unit-%d added successfully\n",
             watch_point,
             unit->unit_id);
    }

  return ret;
}

/****************************************************************************
 * Name: esp_pcnt_unit_remove_watch_point
 *
 * Description:
 *   Remove watch point from given PCNT unit.
 *
 * Input Parameters:
 *   dev - Pointer to the pcnt driver struct
 *   ret - Watch point value to remove
 *
 * Returned Value:
 *   OK on success; ERROR on failure
 *
 ****************************************************************************/

