sc750/nuttx/arch/risc-v/src/esp32p4/espressif/esp_pcnt.c
int esp_pcnt_unit_remove_watch_point(struct cap_lowerhalf_s *dev,
                                     int watch_point)
{
  struct esp_pcnt_priv_s *unit = (struct esp_pcnt_priv_s *)dev;
  int ret = OK;
  int i;
  pcnt_ll_watch_event_id_t event_id = PCNT_LL_WATCH_EVENT_INVALID;
  irqstate_t flags;

  flags = spin_lock_irqsave(&unit->lock);

  for (i = 0; i < PCNT_LL_WATCH_EVENT_MAX; i++)
    {
      if (unit->watchers[i].event_id != PCNT_LL_WATCH_EVENT_INVALID &&
          unit->watchers[i].watch_point_value == watch_point)
        {
          event_id = unit->watchers[i].event_id;
          unit->watchers[i].event_id = PCNT_LL_WATCH_EVENT_INVALID;
          break;
        }
    }

  switch (event_id)
    {
      case PCNT_LL_WATCH_EVENT_ZERO_CROSS:
        pcnt_ll_enable_zero_cross_event(ctx.dev, unit->unit_id, false);
        break;
      case PCNT_LL_WATCH_EVENT_LOW_LIMIT:
        pcnt_ll_enable_low_limit_event(ctx.dev, unit->unit_id, false);
        break;
      case PCNT_LL_WATCH_EVENT_HIGH_LIMIT:
        pcnt_ll_enable_high_limit_event(ctx.dev, unit->unit_id, false);
        break;
      case PCNT_LL_WATCH_EVENT_THRES0:
        pcnt_ll_enable_thres_event(ctx.dev, unit->unit_id, 0, false);
        break;
      case PCNT_LL_WATCH_EVENT_THRES1:
        pcnt_ll_enable_thres_event(ctx.dev, unit->unit_id, 1, false);
        break;
      default:
        break;
  }

  spin_unlock_irqrestore(&unit->lock, flags);

  return ret;
}

/****************************************************************************
 * Name: esp_pcnt_new_channel
 *
 * Description:
 *   Request channel on given PCNT unit and config it with given parameters.
 *
 * Input Parameters:
 *   dev    - Pointer to the pcnt driver struct
 *   config - PCNT unit channel configuration
 *
 * Returned Value:
 *   PCNT unit channel number (>=0) if success or -1 if fail.
 *
 ****************************************************************************/

int esp_pcnt_new_channel(struct cap_lowerhalf_s *dev,
                         struct esp_pcnt_chan_config_s *config)
{
  struct esp_pcnt_priv_s *priv = (struct esp_pcnt_priv_s *)dev;
  int channel_id = -1;
  int unit_id = priv->unit_id;
  int gpio_mode;
  int virt_gpio;
  int ret_id = 0;

  if (!config)
    {
      cperr("Channel config is NULL!\n");
      return ERROR;
    }

  if (!priv->unit_used)
    {
      cperr("Unit did not initialize yet!\n");
      return ERROR;
    }

  if (priv->state != PCNT_UNIT_INIT)
    {
      cperr("Unit already running!\n");
      return ERROR;
    }

  for (int i = 0; i < PCNT_LL_GET(CHANS_PER_UNIT); i++)
    {
      if (!priv->channels[i])
        {
          channel_id = i;
          break;
        }
    }

  if (channel_id == -1)
    {
      cperr("no free channel in unit %" PRId8 "!\n", priv->unit_id);
      return ERROR;
    }

  gpio_mode = INPUT_FUNCTION | PULLUP |
      (config->flags && ESP_PCNT_CHAN_IO_LOOPBACK ? OUTPUT_FUNCTION : 0);
  virt_gpio = (config->flags && ESP_PCNT_CHAN_VIRT_LVL_IO_LVL) ?
      GPIO_MATRIX_CONST_ONE_INPUT : GPIO_MATRIX_CONST_ZERO_INPUT;

  if (config->edge_gpio_num >= 0)
    {
      esp_configgpio(config->edge_gpio_num, gpio_mode);
      esp_gpio_matrix_in(config->edge_gpio_num,
        soc_pcnt_signals[0].units[unit_id].channels[channel_id].\
        pulse_sig_id_matrix,
        (config->flags && ESP_PCNT_CHAN_INVERT_EDGE_IN));
    }
  else
    {
      /* using virtual IO */

      esp_gpio_matrix_in(virt_gpio,
        soc_pcnt_signals[0].units[unit_id].channels[channel_id].\
        pulse_sig_id_matrix,
        (config->flags && ESP_PCNT_CHAN_INVERT_EDGE_IN));
    }

  if (config->level_gpio_num >= 0)
    {
      esp_configgpio(config->level_gpio_num, gpio_mode);
      esp_gpio_matrix_in(config->level_gpio_num,
        soc_pcnt_signals[0].units[unit_id].channels[channel_id].\
        ctl_sig_id_matrix,
        (config->flags && ESP_PCNT_CHAN_INVERT_LVL_IN));
    }
  else
    {
      /* using virtual IO */

      esp_gpio_matrix_in(virt_gpio,
        soc_pcnt_signals[0].units[unit_id].channels[channel_id].\
        ctl_sig_id_matrix,
        (config->flags && ESP_PCNT_CHAN_INVERT_LVL_IN));
    }

  priv->channels[channel_id] = true;

  cpinfo("Added pcnt unit: %" PRId8 " channel: %" PRId8 "\n",
         unit_id, channel_id);

  ret_id = CREATE_RET_CHAN_ID(unit_id, channel_id);
  return ret_id;
}

/****************************************************************************
 * Name: esp_pcnt_del_channel
 *
 * Description:
 *   Delete PCNT unit channel.
 *
 * Input Parameters:
 *   channel - Channel number to delete
 *
 * Returned Value:
 *   OK on success; ERROR on failure
 *
 ****************************************************************************/

int esp_pcnt_del_channel(int channel)
{
  int unit_id = GET_UNIT_ID_FROM_RET_CHAN(channel);
  int chan_id = GET_CHAN_ID_FROM_RET_CHAN(unit_id, channel);
  irqstate_t flags;

  flags = spin_lock_irqsave(&pcnt_units[unit_id].lock);
  pcnt_units[unit_id].channels[chan_id] = false;
  spin_unlock_irqrestore(&pcnt_units[unit_id].lock, flags);

  cpinfo("Deleted pcnt unit: %" PRId8 " channel: %" PRId8 "\n",
         unit_id, chan_id);
  return OK;
}

/****************************************************************************
 * Name: esp_pcnt_channel_set_edge_action
 *
 * Description:
 *   Set channel actions when edge signal changes.
 *
 * Input Parameters:
 *   channel  - Channel number to set actions
 *   post act - Action on posedge signal
 *   neg_act  - Action on negedge signal
 *
 * Returned Value:
 *   OK on success; ERROR on failure
 *
 ****************************************************************************/

void esp_pcnt_channel_set_edge_action(int channel,
    enum esp_pcnt_chan_edge_action_e pos_act,
    enum esp_pcnt_chan_edge_action_e neg_act)
{
  int unit_id = GET_UNIT_ID_FROM_RET_CHAN(channel);
  int chan_id = GET_CHAN_ID_FROM_RET_CHAN(unit_id, channel);
  irqstate_t flags;

  flags = spin_lock_irqsave(&pcnt_units[unit_id].lock);
  pcnt_ll_set_edge_action(ctx.dev, unit_id, chan_id,
                          pos_act, neg_act);
  spin_unlock_irqrestore(&pcnt_units[unit_id].lock, flags);
}

/****************************************************************************
 * Name: esp_pcnt_channel_set_level_action
 *
 * Description:
 *   Set channel actions when level signal changes.
 *
 * Input Parameters:
 *   channel  - Channel number to set actions
 *   post act - Action on posedge signal
 *   neg_act  - Action on negedge signal
 *
 * Returned Value:
 *   OK on success; ERROR on failure
 *
 ****************************************************************************/

void esp_pcnt_channel_set_level_action(int channel,
    enum esp_pcnt_chan_level_action_e pos_act,
    enum esp_pcnt_chan_level_action_e neg_act)
{
  int unit_id = GET_UNIT_ID_FROM_RET_CHAN(channel);
  int chan_id = GET_CHAN_ID_FROM_RET_CHAN(unit_id, channel);
  irqstate_t flags;

  flags = spin_lock_irqsave(&pcnt_units[unit_id].lock);
  pcnt_ll_set_level_action(ctx.dev, unit_id, chan_id,
                           pos_act, neg_act);
  spin_unlock_irqrestore(&pcnt_units[unit_id].lock, flags);
}
